[
    {
      "id": 1,
      "role": "Software Development Intern",
      "company": "Zobyt Inc",
      "duration": "Aug 2022 - Nov 2022 (4 mos)",
      "logoSrc": "/images/zobyt.jpeg",
      "toolsUsed": "Python, FastAPI, PostgreSQL, Docker, TypeScript, React",
      "description": "Maintained and developed the backend codebase built in Python and PostgreSQL. Led data scraping efforts and built a streamlined pipeline for information gathering. Designed and integrated a carpooling algorithm from scratch to minimize the overall distance travelled (Runs in O(nlogn) time). Managed and developed a freelance project through the company for a client where I built an application to automate complex multi-staged excel calculations through a web interface. Created a discord bot from scratch to help aid communications and workflow within the company.",
      "location": "Bangalore, KA"
    },
    {
      "id": 2,
      "role": "Student Researcher",
      "company": "AMuDA lab, Amrita School of Computing, Coimbatore.",
      "duration": "Nov 2019 - Dec 2023 (1 year 1 mos)",
      "logoSrc": "/images/amrita.png",
      "toolsUsed": "GraphDB, InfluxDB, IOT, Cyber-Physical-Systems, Networking, Hosting",
      "description": "Worked on a Sony grant project based on Cyber Physical Systems (Non-refrigerated preservation of agricultural produce using IOT). Redesigned and developed the entire dashboard and improved information flow. Conducted a usability study to improve the design. Worked with a complete microservices architecture. Integrated communication protocols like MQTT, Websockets through Node.js to communicate with the edge device. Worked on integrating GraphDB (developed the onotology) and InfluxDB(to perform timestamp based analysis) to the project. Currently supports local farmers in Coimbatore, TN.",
      "location": "Coimbatore, TN"
    },
    {
      "id": 3,
      "role": "Software Development Engineer Intern",
      "company": "carbonmarketsHQ",
      "duration": "Feb 2024 - July 2024 (6 mos)",
      "logoSrc": "/images/carbonmarketshqlogo.jpg",
      "toolsUsed": "Python, FastAPI, PostgreSQL, GenerativeAI",
      "description": "Was responsible for building and deploying a data integration pipeline for multi-source data standardisation of carbon sequestration data, with the key focus being on update dependability, consistency and data-exception handling.\nWorked solely on a Generative AI powered analytics engine on aggregated climate data.Was responsible for building and deploying a data integration pipeline for multi-source data standardisation of carbon sequestration data, with the key focus being on update dependability, consistency and data-exception handling. Worked solely on a Generative AI powered analytics engine on aggregated climate data.",
      "location": "Bangalore, KA"
    },
    {
      "id": 4,
      "role": "Associate Applications Developer",
      "company": "Oracle",
      "duration": "July 2024 - Present",
      "logoSrc": "/images/oraclelogo",
      "toolsUsed": "Java, OJET, PL/SQL, TypeScript",
      "description": "Working in the Enterprise risk and finance team within Oracle's financial services division.",
      "location": "Bangalore, KA"
    }
  ]
  
